In [10]:
import pandas as pd
import numpy as np

In [9]:
pd.set_option('display.unicode.east_asian_width', True)
pd.set_option('display.max_rows', 10)
pd.set_option('display.max_columns', 50)
df = pd.read_excel('data.xlsx')
print(df.head())

   排名      球员      球队 进球（点球）  出场次数  出场时间  射门  射正
0     1    瓦尔迪    莱斯特        17(3)        20      1800    49    29
1     2      英斯  南安普敦           14        22      1537    57    26
2     3  奥巴梅扬    阿森纳        14(1)        22      1945    55    22
3     4  拉什福德      曼联        14(5)        22      1881    74    34
4     5  亚伯拉罕    切尔西           13        21      1673    66    29

In [11]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [12]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [13]:
dates = pd.date_range('20130101', periods = 6)

In [15]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))

In [17]:
df

                   A         B         C         D
2013-01-01  0.819208 -0.717810  0.402654 -0.562349
2013-01-02 -0.479002 -0.367311 -1.176890 -0.603566
2013-01-03 -0.527028 -0.035436  0.014844  0.088405
2013-01-04 -0.134757  0.124610  1.150850  0.176607
2013-01-05 -0.098269 -1.426733  1.213568 -0.336997
2013-01-06  0.996650  0.170588  0.156895  0.467365

In [18]:
df2 = pd.DataFrame({'A': 1.,
                   'B': pd.Timestamp('20130102'), 
                   'C': pd.Series(1, index = list(range(4)), dtype = 'float32'), 
                   'D': np.array([3]*4, dtype = 'int32'),
                   'E': pd.Categorical(["test", "train", "test", "train"]), 
                   'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [19]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [23]:
df.abs

<bound method NDFrame.abs of                    A         B         C         D
2013-01-01  0.819208 -0.717810  0.402654 -0.562349
2013-01-02 -0.479002 -0.367311 -1.176890 -0.603566
2013-01-03 -0.527028 -0.035436  0.014844  0.088405
2013-01-04 -0.134757  0.124610  1.150850  0.176607
2013-01-05 -0.098269 -1.426733  1.213568 -0.336997
2013-01-06  0.996650  0.170588  0.156895  0.467365>

In [21]:
df2.mode

<bound method DataFrame.mode of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

SyntaxError: invalid syntax (<ipython-input-22-915637deb483>, line 1)